app/controllers/listings_controller.rb

SELECT `listings`.* FROM `listings`
---
  def index
    if session[:user_id]
    @listings = Listing.all

SELECT `listings`.* FROM `listings` WHERE `listings`.`id` = 14 LIMIT 1
UPDATE `listings` SET `intcount` = 4, `updated_at` = '2011-10-15 19:30:12' WHERE `listings`.`id` = 14
INSERT INTO `tips` (`created_at`, `listing_id`, `updated_at`, `user_id`) VALUES ('2011-10-15 19:15:37', NULL, '2011-10-15 19:15:37', NULL)
---
   def apply
    @listing = Listing.find(params[:id])
    @listing.intcount=@listing.intcount+1
    @tip=Tip.new
    @tip.listing_id=@listing.id
     @tip.user_id= session[:user_id]
    @listing.save
      if @tip.save

SELECT `listings`.* FROM `listings` WHERE `listings`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users`
SELECT `pens`.* FROM `pens` WHERE `pens`.`listing_id` = 22 AND (types LIKE '%establishment%')
---
  def show
    @listing = Listing.find(params[:id])
    @user=User.all
    @tip= @listing.tips
    @vv=@listing.pens
    @json=@vv.all.to_gmaps4rails;

SELECT `listings`.* FROM `listings` WHERE `listings`.`id` = 1 LIMIT 1
---
  def edit
    @listing = Listing.find(params[:id])

INSERT INTO `listings` (`address`, `created_at`, `description`, `gmaps`, `intcount`, `latitude`, `longitude`, `rent`, `rooms`, `updated_at`, `user_id`) VALUES ('Directi, Mumbai', '2011-10-15 15:06:09', 'Office Space', 1, 3, 19.0176147, 72.8561644, 4000, 200, '2011-10-15 15:06:09', NULL)
INSERT INTO `pens` (`created_at`, `gmaps`, `icon`, `latitude`, `listing_id`, `longitude`, `name`, `types`, `updated_at`, `url`, `vicinity`) VALUES ('2011-10-16 01:01:03', NULL, 'http://maps.gstatic.com/mapfiles/place_api/icons/geocode-71.png', 28.6336011, 22, 77.2260553, 'Shivaji Bridge Railway Station', '---\n- train_station\n- transit_station\n', '2011-10-16 01:01:03', NULL, 'Connaught Place')
---
  def create
      @listing = Listing.new(params[:listing])
      @listing.user_id= session[:user_id]
      respond_to do |format|
          if @listing.save
            @client = GooglePlaces::Client.new('AIzaSyCzlX9Hndc6BZlHpLVkk8S_xRGOsnA_cJ4')
            @arr=[@listing.latitude, @listing.longitude]
            @vv=@client.spots(@arr[0], @arr[1])
                  @vv.each do |t|
                  @pn= Pen.new
                  @pn.latitude=t.lat
                  @pn.longitude=t.lng
                  @pn.vicinity=t.vicinity
                  @pn.name=t.name
                  @pn.icon=t.icon
                  @pn.url=t.url
                  @pn.types=t.types.join(",")
                  @pn.listing_id=@listing.id
                  @pn.save

SELECT `listings`.* FROM `listings` WHERE `listings`.`id` = 1 LIMIT 1
UPDATE `listings` SET `rent` = 3500, `description` = 'Hostel', `rooms` = 400, `intcount` = 250, `updated_at` = '2011-10-16 09:37:25' WHERE `listings`.`id` = 22
---
  def update
    @listing = Listing.find(params[:id])

    respond_to do |format|
      if @listing.update_attributes(params[:listing])