app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @profile=User.find(params[:id])

INSERT INTO `users` (`contact`, `created_at`, `email`, `name`, `password_hash`, `password_salt`, `updated_at`) VALUES ('9873861438', '2011-10-15 07:46:30', 'neeraj@nsitlounge.in', 'Neeraj Gupta', '$2a$10$D1DRW5yUGi5.Ijuy58xMQulm5rJOaUJpwMzQKxjoFCvMpI4.wghJm', '$2a$10$D1DRW5yUGi5.Ijuy58xMQu', '2011-10-15 07:46:30')
---
  def create
    @user = User.new(params[:user])
    if @user.save